[
  {
    "text": "Would you opt for 128 GB RAM or stick with 64 GB RAM? Is 128 GB overkill or essential?\n\nI know some projects are done on the cloud, and the system often serves more as an access point or gateway. But regardless, would you recommend a data scientist or machine learning engineer to go for 128 GB, or is 64 GB sufficient, especially for future-proofing?\n\nIf you’re not in the tech industry, what would you recommend? Which option is sufficient for your heavy-duty workload?",
    "engagements": 134
  },
  {
    "text": "Common Myths About Data Science\n\nLet's stop making data science hard for beginners\n\nI have noticed that there are some myths surrounding data science, and they can scare people off. So, let’s clear up some of those misconceptions.\n\n1. Myth: 'You Need to Have a Strong Technical Background to Start' \n\n Reality: Technical skills are important, but you don’t need to come from a tech-heavy background to start in data science. Many people have successfully transitioned into data science from fields like marketing, finance, or humanities. What’s important is your willingness to learn and adapt.\nNote: EMPHASIS ON 'YOU HAVE TO BE WILLING & READY TO LEARN'\n\n3. Myth: 'Data Science is only for Math Geniuses' \n\n Reality: You don’t need to be a math expert to succeed in data science. Math and statistics are important, but what’s more critical is how you apply them to solve real-world problems. Tools and libraries can help with the heavy lifting, so focus on understanding the concepts rather than complex calculations.\n\n4. Myth: 'Data Science Jobs Are Only in Tech Companies' \n\n Reality: Data science skills are valuable in many industries, not just tech. Healthcare, finance, retail, and even government agencies need data pros to analyze data and make informed decisions. The skills you acquire can be applied across various sectors.\n\nWhat myths about data science have you heard of?\n\n Repost so others can learn.",
    "engagements": 234
  },
  {
    "text": "If You’re Transitioning into Data Science, Should You Start with a Bootcamp?\n\nIf You’re Thinking about switching into data science or any field, Should you start with a bootcamp?\n\nComment;\n\n→ 'YES' if you’d start with a bootcamp,\n\n→ 'NO' if you’d do something else first.\n\nPersonally:\n\n1. Start with Self-Study First\n\n→ Before you spend money on a bootcamp, begin with self-study. Why? Bootcamps aren’t cheap. Use free resources to explore the field first, watch YouTube videos, read articles, read a book.\n\nYou want to know if data science is something you genuinely enjoy before committing time and money. It’d be frustrating to pay for a bootcamp only to find out halfway through that it’s not really for you.\n\n2. Plan for a few weeks of Self-Study Before Bootcamp\n\n→ Give yourself a few weeks of self-study before committing to a bootcamp. This period will help you confirm if data science is your true interest.\n\nI know someone who started on the data science path but realized within a few months that his real passion was in cloud engineering, and he’s now thriving in that field.\n\n3. Avoid the “Unfulfilled” Feeling\n\n→ Some people finish bootcamps and still feel like they haven’t learned enough. They expected to feel confident but instead feel like they’re back at square one.\n\nMy first question to them? 'Did you do any self-study before the bootcamp?' Often, the answer is no.\n\nBootcamps are great, but a bit of self-study first can help you really connect with what you’re learning.\n\nNote:\n\nWhen I say self-study, I don’t mean building your own curriculum to learn data science & analytics.\n\nIt’s more about getting familiar with the basics, understanding data science concepts, the terms, the skills needed, the progession, etc. Just gather enough info to feel prepared as you start your journey.\n\nRepost so others can learn",
    "engagements": 165
  },
  {
    "text": "Why Are Data Pros Becoming Targets for Job Scams? Read On to Spot the Trends\n\nIt’s becoming all too common on LinkedIn, people trying to scam entry-level, transitioning, and even experienced data professionals.\n\nIn high-demand fields like data science, where the need for skilled talent is rising, there are genuine people willing to help but also those looking to take advantage. I feel it’s important to bring this to light.\n\nHere’s what I’ve noticed and what you should keep an eye on;\n\n1. Be Cautious of “Comment 'Interested'” on Job Posts\n\n→ If a job post asks you to comment 'I'm interested' to receive a link to apply, pause and rethink.\n\nLegitimate jobs typically have a direct application link or redirect you to the company’s website.\n\nThis 'comment for link' approach often signals attempts to gather personal information or boost engagement artificially.\n\n2. Don’t Be Fooled by High Follower Counts Without Credibility\n\n→ Some accounts with huge follower counts, 20k, 50k, even 100k, keep posting “remote job” ads that link to suspicious or broken pages.\n\nA large follower count doesn’t automatically mean credibility. Check their posting history and look for signs that they’re genuinely part of the industry before engaging.\n\n3. Get a Clear Agreement Before Doing Any Work\n\n→ I recently read about someone who completed a job only to realize they wouldn’t get paid. It turned out the “client” was outsourcing work they couldn’t handle and had no plans to compensate.\n\nAlways insist on a formal agreement before starting any work, especially with remote opportunities. Protect your time and effort by setting clear terms upfront.\n\n4. Document Everything\n\n→ For any job-related discussions, keep records of all communication. Relying on 'word of mouth' agreements alone can be risky. Insist on written terms through email or a documented platform to have something concrete if things go sideways.\n\n5. Seek Advice If You’re Unsure\n\n→ If you’re ever in doubt about a job offer or a request, reach out to someone with experience like a mentor or trusted contact in the industry. They can help you identify red flags that might not be obvious at first glance.\n\nStay Smart, Stay Safe\n\nLinkedIn is a great platform, but like any other, it has its share of risks. Trust your instincts, if something feels off, it probably is.\n\nDon’t let desperation cloud your judgment, and remember; not every opportunity is worth your time if it doesn’t pass the sniff test.\n\n If you’ve had similar experiences kindly share in the comments\n\nRepost so others can learn",
    "engagements": 435
  },
  {
    "text": "If You’re an Entry-Level or Aspiring Data Scientist, You Need to Know This\n\nYou might already have an idea of what it takes to be a data scientist. But beyond just building machine learning models, there are a few things that aren’t always talked about but are essential for your day-to-day work.\n\n1. Testing Your Code\n\nYes, you’ll be writing code with Python, but you’ll also be testing it.\n\nEvery script needs to work perfectly before it’s good to go. Start learning libraries like PyTest or unittest to validate your code and catch errors.\n\nTesting is a must because you want to catch bugs early and ensure your code runs smoothly before you push it out. So, as you’re learning Python, make testing part of your routine. It’ll help you understand the logic behind your code.\n\n2. Version Control (Git)\n\n Version control is something you’ll use every day, so get familiar with it now.\n\nBefore you even start writing code, you’ll need to create repositories, branches, and manage versions, these all stem from knowing how to use Git. Know how to:\n\n→ Create branches for different tasks or versions of your project.\n\n→ Commit changes regularly to avoid losing your work.\n\n→ Merge branches without conflicts to keep your project organized.\n\nThis is pivotal for managing projects, especially if you’re working with others. Start with GitHub or Bitbucket . Don’t skip this while you’re learning how to code, it’s essential.\n\n3. CI/CD (Continuous Integration/Continuous Deployment)\n\n CI/CD might sound like something meant for MLOps engineers, but it’s valuable for data scientists too. CI/CD automates steps like testing, building, and deploying code, saving you from repetitive tasks.\n\nEven if you’re not directly setting up CI/CD pipelines, understanding them will make you a more versatile team player. Knowing how it works can be a big plus, especially if you end up in a place where you need to wear multiple hats.\n\n4. Cloud Platforms\n\nYou don’t need to know every cloud platform, but knowing at least one, like AWS, GCP, or Azure, is a must.\n\nMany workflows are moving to the cloud, so understanding how to deploy models, manage resources, and create repositories on a cloud platform can make a big difference. Start with the free tiers of these platforms to get hands-on experience.\n\n5. Communicating Insights\n\nBecoming a data scientist doesn’t stop with data models, it’s also about translating insights to non-technical teams.\n\nBeing able to explain what your model does and how it benefits the business is crucial. Develop your presentation and storytelling skills. Know that sometimes you’ll have to explain complex concepts in simple terms. Use visuals whenever possible.\n\nTake Note of These Skills Beyond Coding\n\nThe more you know, the easier it will be to transition into the field and thrive.\n\n Repost to help others learn more about these essential skills!",
    "engagements": 315
  },
  {
    "text": "What I Did to Gain Experience as a Data Pro While Waiting for a White-Collar Job\n\nYou’ve completed your courses.\nYou’ve practiced doing projects.nYou’re actively applying for white-collar jobs.\n\nBut if nothing is happening right now, one great way to build experience while waiting is by freelancing.\n\n\nWhen I was transitioning to DS from my role as a software developer, I had done all I needed to do: taken courses, practiced, and applied for jobs. But there was still something missing; real-time, hands-on projects.\n\nI decided to sign up on a few freelance platforms. I learned a lot, made a few mistakes, and now I’m sharing tips that will help guide you.\n\n\n1. Find the Right Platforms:\n\nDon’t limit yourself to one platform. Explore Upwork, Freelancer, and others. Each has different types of clients and projects. The more platforms you’re on, the better your chances of landing work.\n\n\n2. Optimize Your Profile:\n\nFirst impressions matter. Highlight your strengths and showcase your portfolio with links or screenshots of past projects, even if they’re small. If you have reviews or feedback from previous work, display them to build trust with potential clients.\n\n\n3. Stay Active & Be Ready to Bid:\n\nFreelancing is competitive. Stay active and be quick to bid on projects. Avoid sending generic proposals. Tailor your bids to each project, explaining exactly how you can help. Show clients you’ve taken the time to understand their needs.\n\n\n4. Communicate Professionally:\n\nWhen responding to bids or communicating with clients, always sound professional.\n\nDon’t rely heavily on tools like ChatGPT, clients can tell when it feels robotic. Use your own words and let tools assist with minor corrections like punctuation or tense.\n\n\n5. Set Realistic Deadlines:\n\nDon’t overpromise just to win a project. Set realistic expectations and factor in time for revisions or potential delays. Meeting or exceeding deadlines will build a reputation for reliability.\n\n\n6. Automation & Efficiency:\n\nOne thing I can’t stress enough, automate repetitive tasks. If you’re manually repeating the same steps for every project, you’re wasting time that could be spent bidding on new work or completing tasks faster.\n\nA simple Python script can handle routine tasks, allowing you to manage more projects simultaneously.\n\nTrust me, without automation, you could be stuck on one project for a whole month, when it should’ve taken just a few weeks.\n\n\n7. Mistakes to Avoid:\n\nTaking on too many projects at once: It’s tempting to say yes to every opportunity. Focus on delivering quality work for a few projects.\n\nNot asking enough questions upfront: Don’t assume you understand the project fully without asking detailed questions. Clarify everything before starting to avoid mid-project confusion.\n\n\nRepost so others can learn",
    "engagements": 382
  },
  {
    "text": "A Comprehensive Guide to Start Your Data Science Journey Based on Industry Demand.\n\nBefore getting into the guide and feeling overwhelmed, let’s chat about what you should focus on first.\n\nI’ve broken this guide into two parts:\n\nGuide 1: Get the Job First (Essential Topics to Cover)\n\nThis guide is your fast track to landing that first data science job. Focus on these key areas.\n\nGuide 2: This is a more comprehensive guide for continuous growth in your data science journey. Once you’ve landed the job, use it during your free time or when your role requires you to expand your knowledge.\n\nI’ll be sharing Guide 2 exclusively on my channel, click the link in my bio to join and stay updated.\n\n\nWhat to prioritize in Guide 1:\n\n1. Mathematics:\n\nFocus on the basics like Calculus and Algebra.\n\n\n2. Python:\n\nGround yourself in Python. It’s a must for any data science role. And don’t forget to learn PYTEST for writing and running tests.\n\n\n3. Data Structures & Algorithms\n\nLearn the basics like lists, queues, and dictionaries. You don’t need to be a computer scientist, just know the fundamentals.\n\n\n4. Pandas, Numpy & Matplotlib:\n\nThese libraries are essential. Make sure you know them thoroughly.\n\n\n5. Statistics & Probability:\n\nA solid foundation here is non-negotiable, especially for machine learning.\n\n\n6. Machine Learning:\n\nLearn regression, classification, and clustering. Understand the algorithms and how to evaluate models.\n\n\n7. NLP & Computer Vision:\n\nMaster NLP.\n\nIf you’re focusing on Computer Vision, explore it further; otherwise, just get the basics.\n\n\n8. SQL & Big Data Analysis with PySpark:\n\nSQL is valuable, learn how to query and handle data.\n\nPySpark can come later; focus on SQL first, even if you won’t use it every day.\n\n\n9. Deployment (GCP, AWS, or Azure):\n\nLearn at least one cloud platform for deploying models. Start with the basics and build from there.\n\n\n10: Version Control (Git):\n\nAbsolutely essential. Master version control early on. This is non-negotiable.\n\n\nYou won’t need every skill every day, but knowing them prepares you for future roles. Focus on the core areas first, and build from there.\n\n\nRepost is others can learn",
    "engagements": 207
  },
  {
    "text": "Why Are You Self-Rejecting Before the Company Even Rejects You as a Data Professional?\n\nYou know that feeling when you’re scrolling through a job description and think, ‘I’m not ready,’ ‘I need more time to prepare,’ or ‘I don’t know enough yet?’ That’s self-rejection, and it might be holding you back more than you realize.\n\nSelf-Rejection vs. Imposter Syndrome:\n\nImposter syndrome is when you’re already in the job and feel like you’re not good enough.\n\nSelf-rejection, on the other hand, is when you don’t even let the company have the chance to reject you, you’ve already said no to yourself.\n\n\nI’ve seen it happen a lot, especially in the data space. You see a job, you check the requirements, and suddenly it’s, ‘Nah, I’m not ready.’ Just like that, you’ve closed the door on an opportunity.\n\n\nBut why don’t you just try? What’s the worst that can happen? The company says no? So what? It’s way better to hear a ‘no’ from them than to tell yourself ‘no’ before you even start.\n\n A Real-Life Example:\n\nI know someone who kept saying they needed more certifications to apply for their dream role. They did 10 certifications in one year and still felt unprepared.\n\nI had to step in, optimize their LinkedIn, and enable the ‘Open to Work’ setting. Within 24 hours, a recruiter reached out. Guess what? Only three of those certifications were actually needed for the job they wanted.\n\nThe Lesson:\n\nCertifications and extra knowledge are great, but sometimes you already have what you need.\n\n Takeaway:\n\nStop self-rejecting. As you head into this week, take the chance, apply for the roles, and let the company make the decision.\n\nIt’s better to be rejected by them than to reject yourself first. You never know what’s waiting for you until you try.\n\n\n Repost so others can learn.",
    "engagements": 353
  },
  {
    "text": "Data analysis = a task or action you do.\n\nData analytics = the field or specialization that includes tasks like data analysis, along with other methods and processes.\n\nData analysis is not a field, it’s a process. It refers to the steps you take to examine data, find patterns, and draw insights.\n\nData analysts and data scientists perform data analysis as part of their work.\n\n\nHappy weekend ",
    "engagements": 186
  },
  {
    "text": "Friday Book Recommendations for Data Pros Just Starting Their Journey\n\nIt’s Friday, and I’ve got some books that really helped me out along the way, and I want to share them with you. These are beginner-friendly, no jargons, just what you need to know to get started.\n\n\n1. No Bullshit Guide to Linear Algebra.\n\nIf you’re trying to wrap your head around linear algebra, this is your book. It’s straightforward, skips the unnecessary stuff, and gets to the point. Perfect for you if you want a solid foundation in data science.\n\n\n2. Practical Statistics for Data Scientists.\n\nYou need to know statistics. If you’re a data analyst or a data scientist, this book breaks down the essentials like; mean, median, distribution, probability, etc., and it does it using both R and Python. This isn’t just theory; it’s practical. You’re going to need this.\n\n\n3. Python Data Science Handbook.\n\nYes, Python is the language of choice for data science, and this book will guide you through it. It includes all the important libraries, like NumPy, Pandas, Matplotlib, and SciPy. By the end, you’ll be running analysis like a pro.\n\n\n4. Machine Learning Yearning.\n\nIt’s essential to know what machine learning is, but also understand the mindset behind solving problems. This one is by Andrew Ng (you know, the guy behind one of the most popular ML courses). This book is all about how to structure machine learning projects.\n\n\n5. Introduction to Deep Learning.\n\nOnce you understand the basics, this book will guide you to deeper topics like neural networks and deep learning. You need to understand the fundamentals of neural networks to level up.\n\n By the time you’re done with these books, you’ll be well on your way to becoming a data pro.\n\n\n Repost so others can learn",
    "engagements": 276
  },
  {
    "text": "What Really Motivated Me to Pursue a Career in Data Science?\n\nTo make more money  Just joking.\n\nThe truth is, what actually motivated me was my love for AI and machine learning. It’s always been my passion, my second love.\n\nWhen I graduated from university, there weren’t really data-related jobs out there. So, I ventured into something I enjoyed, which was software development. It was fulfilling, but not completely. Deep down, I knew it wasn’t the end of my journey.\n\nThat passion for AI and machine learning was still pulling at me. Eventually, I made the leap into data science, and the rest is history.\n\nWhat kept me moving wasn’t the trends. It wasn’t because data science suddenly became 'cool' or 'in-demand.' It was because I genuinely loved it from the very beginning.\n\nBack then, the trending career in tech was Cybersecurity , but that didn’t sway me. For me, it was always AI and machine learning. It wasn’t about what was hot at the time, it was about what made me feel excited, curious, and fulfilled.\n\nWhat motivates you?\nIt could be anything, and that’s perfectly okay.\n\n- Maybe it is the money (and that’s fine, too).\n\n- Maybe you’re motivated by the idea of using the knowledge to start your own business.\n\n- Maybe your motivation is personal growth or solving real-world problems.\n\n- Maybe you’re motivated by the desire to make an impact with your work.\n\nWhatever it is, always keep it in mind. Because the truth is, this journey isn’t always easy. There will be challenges, setbacks, and days when you feel like giving up.\n\nIn those moments, remember what motivated you in the first place. Use that to fuel you when things get tough.\n\nAt the end of the day, the key to longevity in this field, or any field, is to stay connected to why you started in the first place.\n\n What motivated you to pursue a career in Data?\n\n Repost so others can learn",
    "engagements": 281
  },
  {
    "text": "Today, I’m Taking a Step Back\n\nThis post is a bit different from my usual content, but it’s something I feel I need to address. Since I started talking about the data science ecosystem and related terms, I’ve noticed some gaps and disagreements in the comments.\n\nIt’s okay to have different views, but when these basic terms get confused, it can create unnecessary confusion, especially for those who are new to the field and trying to learn.\n\nSo today, instead of replying to every comment individually, I’m sharing some helpful links in the comments. I encourage you to take some time, 30 minutes or an hour to read through these resources and get a clearer understanding of the concepts. It’s essential to get the basics right before learning tools.\n\nTake the time today, go through the links, and really understand the data science ecosystem and how the various roles fit together.\n\nAside from the links I will be sharing in the comments, you can also google some of these terms and read them.\n\ Kindly share what you have learnt from the article.\n\n Repost so others can learn",
    "engagements": 381
  },
  {
    "text": " One Major Challenge You Will Face When You Start Working as a Data Pro\n\nOne major challenge you’ll face is giving or receiving constructive criticism. Sometimes you might not give it, or other times someone around you may not give it properly.\n\nLet’s say you have someone in your team whose work is not up to standard. How would you give feedback? Think about it, I will come back to this in a moment.\n\n Recently, I shared a post about the data science ecosystem. As expected, there were a few people who disagreed, which is totally fine.\n\nHowever, one person commented, ‘I totally disagree,’ and just left it there. No context. No explanation. And this is exactly how not to give feedback.\n\nHow should you give constructive criticism the right way?\n\nLet’s go back to the scenario of giving feedback on your colleague’s work:\n\nWhat you shouldn’t do:\n\n→ ‘Favour, this dashboard looks terrible. It’s way too colorful.’\n\nWhat you should do:\n\n→ Start with positive feedback:\n\nAcknowledge the effort they’ve put in.\nE.g.: ‘I can see you worked hard on this dashboard, and I love the insights you’ve provided.’\n\n→ Provide a suggestion for improvement:\n\nInstead of saying ‘This is too colorful,’ be specific.\nE.g: ‘However, I think the color scheme might be too distracting for the stakeholders. What if we try a more neutral palette to focus on the data?’\n\n→ Explain why:\n\nAlways give reasoning behind your suggestion.\nE.g.: ‘From what I’ve read, using red in dashboards can signal negative performance, so switching to blue will give a true representation of the insight.’\n\nSee the difference? You’re not attacking their work, you’re acknowledging their effort and giving constructive feedback in a respectful way. And by asking, ‘What do you think?’, you’re showing that you value their input too.\n\nWhy is this important for your career?\n\n→ If you don’t know how to give constructive criticism, people might start seeing you as someone with a difficult personality, and you could end up damaging relationships before you even realize it.\n\n→ When you’re working in a team, how you communicate feedback can either build strong relationships or damage them.\n\nA more constructive approach to feedback:\n\nInstead of a comment like ‘I totally disagree,’\na better response could be something like this:\n\n‘I appreciate your insights, and I see where you’re coming from. However, I believe data analysts should be categorized differently because… (and provide your reasoning and, if possible, reference data to support your view).’\n\nIt’s not that hard, right? This approach shows respect for the other person’s effort and opens up the conversation, rather than shutting it down.\n\nRemember: Feedback without context only makes people less receptive. It’s simple to show respect and create an open, constructive conversation.\n\n Repost so others can learn.",
    "engagements": 400
  },
  {
    "text": "They Laughed When I Said I Wanted to Become a Data Scientist\n\nDuring my Master’s program, a professor walked into the class one day and asked:\n\n→ ‘How many of you want to become data engineers?’ A few hands went up.\n\n→ ‘How many of you want to become data analysts?’ A few more hands were raised.\n\n→ Then he asked, ‘How many of you want to become data scientists?’\n\nI was the only one who raised my hand.\n\nThe moment I did, the room went silent for a second before the whispers, laughter, and side comments started (aside from my friend, though. Everyone looked at me like I had just done something funny.\n\nThe professor noticed the reaction and said, ‘You’re all laughing now, but don’t be surprised if she becomes exactly what she says she wants to be after you all graduate.’\n\ At that moment, I wasn’t upset or even surprised. I realized that people often project their fears and limitations onto others. They assume that what seems hard for them must also be hard for you.\n\nThey weren’t laughing at me, they were probably laughing because they saw the path of a data scientist as difficult.\n\nPeople will always doubt you when something seems hard to them. People will throw their insecurities onto you. Just because they can’t do something, they’ll assume you can’t either.\n\nThey’ll tell you it’s too difficult, that you should try something easier. But that’s just their perspective, not yours.\n\nSome of the people who made side comments that day didn’t know my background, my journey, or my experience, and that’s okay.\n\nBut it got me thinking:\n\n→ What if I was new to this?\n\n→ What if I didn’t have any experience in data science?\n\n→ Could their laughter have made me question my decision to pursue this path?\n\nPeople will doubt you regardless. But remember, their doubts don’t define your path.\n\nTo you, becoming a data analyst may seem easier, but to someone else, it might feel just as hard as data science does for others.\n\nSo, if your goal is to become a data scientist, analyst, engineer, cybersecurity professional, or even a technical writer, don’t let the side comments or doubts get to you. As long as you know what you want and are determined to achieve it, then go for it.\n\nIt’s your journey, not theirs. So own it.\n\nRepost so others can learn",
    "engagements": 1491
  },
  {
    "text": "How I Tailored My CV to Land My Data Job\n\nSomeone recently asked me in the comments, 'How exactly do you tailor your CV based on the job description?'\n\n This topic is long, so I’ll cover four key points for now, but there’s more to come in future posts.\n\n1️. Analyze the Job Description: \n\n→ Study the job description to identify specific skills, tools, and keywords. For example, if the job requires Python, SQL, and machine learning, ensure those keywords are front and center on your CV.\n\n Tip: Use the job description's keywords throughout your CV to help it pass ATS (Applicant Tracking Systems) and make it easier for recruiters to see how your experience matches their requirements.\n\n2️. Use of Icons and Embedded Links: \n\n→ Embed external links (e.g., GitHub, LinkedIn, portfolio) as text or icons instead of exposing full URLs. This can prevent ATS systems from flagging them as sensitive information and rejecting your CV. I’ll leave a guide in the comments on how to do this.\n\n3️. Skills Come First (For Entry-Level Applicants): \n\n→ At the entry level, place your skills right after your profile summary. This is your opportunity to showcase technical abilities since you may have less work experience.\n\n Tip: Reorder your skills to match the job description. If Tableau is prioritized, list it before Python, and tailor this section for every job application.\n\n4️. Highlighting Work Experience: \n\n→ Even if you don’t have formal data roles, use relevant experience from internships, freelance work, or academic projects. Focus on impact and quantify your achievements.\n\n Here’s how to structure it:\n\nA. Use Action Words, Tools, and Results: \n\n→ Don’t just list responsibilities, highlight results and the tools you used. This helps ATS systems pick up relevant keywords and shows hiring managers how you applied your skills in real-world contexts.\n\n Example: \n\n→ Developed SQL queries to analyze customer behavior, leading to a 15% increase in retention.\n→ Built Power BI dashboards to visualize insights used by senior management.\n\n Notice how these examples combine: \n\n→ Action words ('Developed,' 'Built')\n\n→ Tools (SQL, Power BI)\n\n→ Results (15% increase in retention)\n\nB. Why This Matters for ATS and Hiring Managers: \n\n Including tools and methodologies helps your CV rank higher in ATS and provides hiring managers with insight into how you achieved your results.\n\n Final Words\n\nThere’s no one perfect CV format that works for everyone. Some CVs start with education before skills, while others don’t even include a profile summary. But no matter the format, make sure you’re including key information like:\n\n• Contact info (embed links)\n• Profile summary (if needed)\n• Skills (tailored to the job)\n• Work experience with tools, action words, and results\n\nCheck the comment for more tips\n\n Repost so others can learn",
    "engagements": 1483
  },
  {
    "text": "What’s the biggest challenge you’ve faced or anticipate facing in breaking into this field?\n\nFor me, I had a couple of challenges I anticipated and then others I faced head-on.\n\nFirst off, I faced job rejectionssssssssssss (yes, that many). This is a story for another day.\n\nAlso, I was self-learning while working as a software engineer. I got lost trying to figure out which tutorial to start with first. I’d start one, then halfway through, I’d jump to another one. \n\nEventually, I realized I wasn’t paying attention to the prerequisites. \n\nTip: before you start any course, always check the prerequisites. If you don’t have them, go back, complete that, and then come back to the main course.\n\n What challenges have you faced? Drop your answer in the comments, someone might just come to your aid.\n\n Repost so others can learn",
    "engagements": 137
  },
  {
    "text": " How I Landed My Job as a Data Scientist….\n\nHow did I secure my data science roles over the years? It wasn’t an overnight thing, it took time, careful planning, and a lot of persistence. If this is something you’ve always wanted to ask, then continue reading.\nHere's what I did\n1. Focused Job Search:\n→ I didn't just apply everywhere. I made a list of companies that aligned with what I wanted in my career, my goals and growth.\n2. Direct Applications:\n→ When I find a position that really resonates, I usually go straight to the company’s website to apply. I don’t rely on 'Easy Apply' on LinkedIn because I want to make sure my application reaches the right people. \nThat said, on days when I’m super busy and just want to get my application out there, I’ll use EasyApply. There’s nothing wrong with it, but I like to make sure I cover all bases by also applying directly through the company’s career page.\n3. Customizing My CV:\n→ Instead of using a generic CV, I tailored mine to match each job. I paid attention to the details in the job description and made sure my CV spoke directly to what they were looking for.\n4. Applying with Intention:\n→ Hitting the ‘Apply’ button wasn’t a rushed decision. I made sure each application was thoughtful and thorough, so I felt confident that I was giving myself the best shot.\n5. Preparing While Waiting:\n→ While waiting for responses, I spent time researching the companies. I wanted to know their values, their products, and their culture. I also prepped for interviews by thinking of questions I wanted to ask.\n6. Acing the Interview:\n→ When I finally got the interview, I prepared for each stage. From technical tests to conversations about company culture, I made sure I was ready to showcase my skills and fit for the role.\nThe job hunt isn’t always easy, but keep at it. Sometimes, all it takes is that one ‘yes.’\nIs there any step you would have added?\nHow do you approach your job search?\nRepost so others can learn",
    "engagements": 128
  },
  {
    "text": " Imposter Syndrome Almost Stopped Me from Becoming a Data Scientist……\nGrowing up, I often felt like I was underestimated by others. In class, whenever the teacher asked me a question, I’d freeze. I remember just standing there, heart racing, brain seemingly in slow motion. Then, after what felt like an eternity and a few scoldings later, I’d finally blurt out the answer, and to everyone’s surprise, it was usually correct.\nBut even when I knew the answers, I couldn’t shake the fear. I’d always think, 'What if I’m wrong? What if I mess up?' This constant cycle of 'what if' made me second-guess myself\nI remember one report card comment from my teacher that read, 'She’s very intelligent but lacks confidence.' That remark stuck with me. I was just a kid then, but that comment stuck with me.\nFast forward to secondary school, and the same pattern continued. I knew the course materials, but I was still scared to speak up. I’d hang out with the smart kids, thinking they knew way more than I did. But deep down, I started to question why I was so afraid when I knew I was just as capable.\nThen, during my 200-level first semester at university, something inside me changed. There was no big event, no external trigger, I just resumed the semester and told myself, 'Enough is enough.'\nSometimes, you don’t need a major life event to make a change. It’s that inner voice, that you’re tired of holding yourself back. And in that moment, I decided I couldn’t let fear control me anymore.\nFrom then on, I promised myself I’d stop doubting what I knew and start believing in my abilities. And with that decision came results.\nFrom that moment until I graduated, I earned straight A’s, finishing my undergrad with a 4.96/5.0 GPA and my Master’s with distinction.\nWhen I look back now, it’s clear how much lack of confidence can hold us back. And it all comes down to one thing, I stopped letting fear and self-doubt control my life.\n If you’re in the tech field, especially in data science, analytics, or engineering, where imposter syndrome can be a daily struggle, don’t let self-doubt hold you back.\nYou don’t need a 'trigger' to make a change, you just need that quiet decision inside of you to stop playing small.\nIf you're afraid to apply for that new role, take on a project, or speak up in a meeting, just remember that you’re probably more capable than you think.\nImposter syndrome grows in isolation, but once you take that first step, once you trust yourself a little more, you’ll realize how much you've been underestimating yourself.\nTrust your skills, believe in your potential, and let the world see what you're capable of.\n Repoat so others can learn",
    "engagements": 1061
  },
  {
    "text": " Why Documentation Could Be the Most Underrated Skill for Data Scientists, Analysts & Engineers\nI don’t know if documentation counts as a soft skill, but I’d argue that it helps with your writing and communication skills. I believe it’s something you need to consider doing. When you start working in a company, there’s no avoiding it, you will need to document your work.\nWhen I graduated from my undergrad and was self-learning, I wasn’t really taking documentation seriously. I knew documentation was important in a work setting, but I felt that since I was just learning, there wasn’t a real need to document.\nI worked on some projects and faced challenges. But because I wasn’t documenting my work, I sometimes struggled to remember why I used certain techniques.\nI’d find myself repeating the same steps or troubleshooting an error in my code because I couldn’t remember the exact steps I had taken weeks before.\nIf I had documented my process, I could have easily referenced it and saved myself time and effort.\nThat’s when I realized documentation isn’t just for the team or the company, it’s for you.\nHere’s why it’s important:\n1. In a Company:\n→ Team Collaboration:\nYou’re not working alone. Your documentation helps others understand your work and pick up where you left off.\n→ Knowledge Transfer:\nWhen you document your process, you ensure that anyone who takes over your project can follow your logic and build on it.\n→ Consistency:\nIt keeps your work consistent and organized, making it easier for you and your team to reference and review.\n2. For Self-Learners:\n→ Personal Reference:\nDocumenting your projects helps you remember what you did, why you did it, and what you learned.\n→ Progress Tracking:\nIt allows you to track your progress and see how your skills are evolving.\n→ Problem Solving:\nWhen you hit a bottleneck, having a documented record can help you figure out what went wrong and how to fix it.\n How to Document Your Work:\n1. For Self-Learners: \n→ Personal Diary:\nJot down troubleshooting steps, solutions, and insights.\n→ GitHub:\nStore your projects, notebooks, and code. It’s useful for revisiting old work and accessing it from anywhere.\n→ Notion or Evernote:\nOrganize your notes, track your learning progress, and save useful resources.\n Repost so others can learn",
    "engagements": 624
  },
  {
    "text": "My Life Working 9-5 as a Data Scientist Is No Joke\nIt’s not easy balancing a full-time job, personal life, and self-care. But one thing I never fail to do is dedicate at least 2 hours every day to learning. It’s honestly the only way to grow and stay ahead in this field.\nIt wasn’t easy at first. There were days when I felt too tired to even open my laptop, but over time, I realized that this daily habit is what helps me continue growing in my career.\nNow, not every day is about active reading. Some days, I’m doing what I like to call passive learning, like listening to podcasts while doing other tasks.\nThe 2-Hour Rule has become a lifeline for me, and here’s how you can make it work for you too;\n1. Break It Up\n→ You don’t have to do the full 2 hours all at once. Some days, I split it, 30 minutes in the morning before work, an hour during lunch or right after work, and the rest before bed. Breaking it up makes it feel less tiring.\n2. Passive Learning\n→ When I don’t feel like sitting down and reading an article or tutorial, I switch to passive learning. This means listening to a podcast, YouTube video, or webinar while cooking, commuting, or resting.\n3. Create a Daily Routine\n→ You have to be consistent. Just like you have a set time to get ready for work, find a specific time every day dedicated to learning.\nIn addition to my daily learning, I also allocate time for personal care, physical exercise, and family time.\nThis balance is what keeps me motivated.\nHave you implemented a daily learning habit? What’s your strategy?\n Repost to share and inspire others",
    "engagements": 161
  },
  {
    "text": "PhD or Data Science Job? The Toughest Decision I’ve Had to Make…..\n\nHave you ever been caught between two fantastic opportunities and didn’t know which one to pick? That was exactly where I found myself not too long ago.\nI came across a fully funded PhD scholarship from one of the top universities in the UK, focusing on AI and data science.\nNow, if you know how competitive PhD scholarships can be, you’d understand why I was hesitant to apply. \nBut since I had some free time, I thought, why not? I applied, not expecting much, but I prepared myself regardless.\n\nA few weeks later, I got invited to an interview with a panel of SEVEN professors. Yep, seven.  \nI was nervous, but I had prepped like my life depended on it. Fast forward: I passed all the interview stages and received an offer for a fully funded, four-year PhD. You can imagine how happy I was.\nBut here’s the thing, right after that, I also received an offer for a data scientist role at one of the top insurance companies in the UK. Now, I was really torn. Do I go down the academic route, which I’ve always dreamed of, or do I go into the industry and gain more hands-on experience?\n\nI’ve always known I wanted to get a PhD, it’s been a long-term goal. I want to deepen my knowledge, create novel research, and contribute something meaningful to the field. But in that moment, I had to think about timing.\nI asked myself, \"Would I be able to contribute more to academia if I had more real-world experience under my belt first?\"\nThat’s why I chose the industry path. Not because I gave up on the PhD dream, but because I felt gaining more industry experience now would help me shape better, more impactful research later. By the time I pursue that PhD, I’ll have practical knowledge to guide me, rather than just theoretical ideas.\nSo, why am I telling you this? \nThere will come a time in your life when you’ll be faced with a tough decision between two things you love, and the truth is, nobody can make that decision for you.\nMaybe you’re thinking of switching into data from a non-technical background. You might feel unsure, and others may even doubt your ability to succeed. But remember, you are the only one who knows what aligns with your goals. Don’t just follow trends or let others’ opinions sway you, choose the path that makes the most sense for you.\n And remember, just because you pick one path now, doesn’t mean you can’t diversify later. There’s time for everything.\nRepost so others can learn",
    "engagements": 1863
  },
  {
    "text": " Reality Check for Aspiring Data pros……...\n\n You’ve done the boot camps, built your portfolio, and you’re ready to land your dream job as a Data Scientist, Data / MLOps Engineer, or Analyst. But what happens when months go by, and you haven’t secured that role yet? \nIt’s frustrating, I know, but here’s the reality: not everyone gets their ideal data role right away, and that’s okay.\nWhat can you do in the meantime? Diversify. \nInstead of waiting for that perfect data role, look for related positions that will still keep you in the tech space and help pay the bills. Consider roles like:\n- Database Administrator\n- Technical Support\n- Project Management\n- Product Analyst, etc…\n These roles might not be exactly what you envisioned, but they offer invaluable benefits:\n1. You gain experience.\nStaying active in the tech space keeps your skills sharp and prevents your resume from showing long gaps.\n2. You earn a paycheck.\nLet’s face it, we all have bills to pay. Taking a role that leverages your skills will help you stay financially afloat.\n3. You might pivot internally.\nI know people who started as IT support Eng, customer Representatives, and later transitioned to data roles within the same company. Showing initiative and building relationships can open unexpected doors.\n Most importantly, by diversifying your opportunities, you keep learning and growing. You’ll be surprised how much these roles can teach you, giving you an edge when the data job you’ve been working towards finally comes along.\nRemember, the path to your dream job isn't always direct, and that’s part of the journey.\n Repost so others can learn",
    "engagements": 403
  },
  {
    "text": "Data Analysts: Are You Exploring or Solving a Problem?\n\nWhen you're working as a data analyst in a company, you're rarely exploring data just for the fun of it. There's usually a clear business problem that needs solving, it could be improving sales, predicting customer churn, or optimizing inventory.\n\nBut what if you're still learning or transitioning into the field? Should you explore data freely, or should you approach every dataset with a business question in mind? \nLet’s break it down:\n\n1. In a Company: It’s All About the Business Problem \n\nWhen you're working with data, you’re not just poking around to find \"something interesting.\" Every analysis is linked to a specific business objective. Your work is driven by the need to answer clear business questions.\n\nExample Business Questions:\n - How can we predict customer churn based on past behavior?\n - Which regions are underperforming, and why?\n - What product categories are driving the most sales?\n\nIn a company, always start by asking, “What business problem am I solving?”\n\n2. For Self-Learners: Exploration vs. Business Questions \n\nIf you're self-learning or transitioning into data analytics, exploring datasets can be fun and insightful. It helps you get a feel for the data, spot trends, and understand analysis processes. Exploration is a key part of growth.\n\nBut don’t stop there.\n\nPractice Framing Business Questions: Even if you’re not in a job yet, train yourself to think about business problems. Why? Because once you transition into a company role, this will be the standard practice. The earlier you practice aligning your analysis with real-world business goals, the smoother your transition will be.\n\nDo you start with a business question, or do you let your data guide you?\nRepost so others can learn",
    "engagements": 463
  },
  {
    "text": "Data Engineers, Data Scientists, Data Analysts: Let's Clarify Your Roles….\n\nThe truth is, you can’t be an expert in everything. Having a broad knowledge base is great, but you can’t master every role. I often see roles and responsibilities for data engineers, data scientists, and data analysts getting mixed up.\n\nIn reality, depending on the company, roles might overlap. For example, a data analyst in one company might do tasks that seem like a data engineer's job, and a data scientist in another might handle what seems like a software developer's work. But let’s not forget the core responsibilities that make each role unique\n\nHere’s a quick refresher on the core responsibilities:\n\n1. Data Engineers: Your main focus is on managing data infrastructure, extracting datasets from cloud or warehouses, and performing ETL processes to ensure data is formatted correctly (e.g., CSV, JSON).\n\n2. Data Analysts: You handle sourcing datasets, visualizing and analyzing data, and engaging with stakeholders to answer business questions. Your role is about using data to provide insights and drive decisions.\n\n3. Data Scientists: Your core duties include preparing data, conducting in-depth analysis, and building predictive models. You use the datasets provided by data engineers and insights from data analysts to answer complex business questions.\n\n4. MLops. Engineers: You are responsible for deploying models, building pipelines, and handling CI/CD processes. Depending on the company’s size, data scientists or data engineers might also take on some of these tasks, but these are your core responsibilities.\n\nUnderstanding and focusing on these core responsibilities will help you excel in your role. If you’re transitioning into these fields, hone in on your core responsibilities first. \nOnce you're confident and skilled in your main tasks, adding additional skills from other areas will definitely boost your career.\n\nIs your current role overlapping?\nRepost so others can learn",
    "engagements": 317
  },
  {
    "text": "Have you ever found yourself torn between following a stable career path and pursuing your entrepreneurial dreams? I was faced with this dilemma not long ago. I had an offer to join a leading tech firm in the US, but my passion for building a startup in AI kept calling me. After a lot of soul-searching and discussions with mentors, I chose to follow my entrepreneurial vision. Here's why:...\nThe uncertainty of entrepreneurship is daunting, but the fulfillment of creating something from scratch is unmatched. It's not an easy path, but it's mine.\nRemember, some decisions define your path, but they don't lock you in forever. You can always evolve.",
    "engagements": 785
  },
  {
    "text": "I made the leap into data science from a completely different field, and let me tell you, it wasn’t all smooth sailing. It was a decision filled with uncertainties, but it’s one I don’t regret. The reality is, transitioning into data science can be tough – from boot camps to building portfolios, it takes a lot of grit.\nHowever, the payoff is real. Here's my journey of facing imposter syndrome, learning new skills, and eventually landing my first role. Don't be afraid of the challenges; they’re all part of the process.",
    "engagements": 321
  },
  {
    "text": "When I received a fully funded PhD offer in Machine Learning from a prestigious university, I was thrilled. But soon after, I got an offer for a senior data analyst position at a major corporation. Now, what? Should I pursue academia and spend years researching, or dive straight into the fast-paced world of industry?\nAfter some serious thought, I chose to embrace industry first. I believe real-world experience will help me create research that has a real impact. The academic world will always be there for me. It’s a choice I don’t regret.",
    "engagements": 1983
  },
  {
    "text": "The road to success in data science isn’t always linear. At times, it feels like you’re working hard without any real progress. I’ve been there. But the key is persistence. Whether you’re a beginner or in the middle of transitioning to a new role, you must remember: results don’t always come instantly.\nHere’s what helped me push through: setting small, achievable goals, celebrating every learning milestone, and building a solid network of like-minded individuals.",
    "engagements": 472
  },
  {
    "text": "It’s normal to feel like an imposter, especially when you first enter the field of data science. When I first started, I compared myself to people with years of experience and felt like I wasn’t good enough. But the truth is, everyone starts somewhere. The more I learned, the more I realized that it's okay not to know everything.\nYou don't need to have all the answers to make an impact. The key is to keep learning and evolving.",
    "engagements": 194
  },
  {
    "text": "As the demand for data professionals grows, there’s an ongoing debate: should you specialize in one area or be a jack-of-all-trades? I spent a lot of time wondering whether I should specialize in machine learning or become a generalist. Ultimately, I realized that having a deep understanding of one area gives you expertise, but knowing a bit about many areas gives you flexibility.\nBoth paths have their advantages. The key is to find your sweet spot based on your interests and goals.",
    "engagements": 250
  },
  {
    "text": "Networking is a powerful tool in data science. Early on in my career, I was hesitant to reach out to people in the industry, thinking they’d never respond. But the truth is, building relationships with others can open doors you never thought possible.\nThrough networking, I gained valuable mentorship, collaborated on exciting projects, and eventually secured my first full-time role. Don’t underestimate the power of a simple LinkedIn message or coffee chat.",
    "engagements": 1327
  },
  {
    "text": "Building a portfolio in data science is crucial. It’s not just about having technical skills; it’s about showing that you can solve real problems. Early on, I focused on completing boot camps and certifications, but soon realized that a portfolio showcasing my personal projects and case studies was the key to standing out.\nHere’s how I built my portfolio: I started by solving business problems, documenting my process, and sharing my work on GitHub. Be sure to present both the technical aspects and the business outcomes.",
    "engagements": 214
  },
  {
    "text": "In data science, the learning never stops. Even after years of experience, I find myself learning new techniques, tools, and frameworks. Whether it's through online courses, reading research papers, or attending conferences, it’s essential to stay updated.\nHere’s my approach to continuous learning: I dedicate a few hours each week to mastering something new, whether it’s deep learning or data visualization. It’s a mindset that keeps me ahead in this fast-evolving field.",
    "engagements": 190
  },
  {
    "text": "I didn’t come from a computer science background, yet here I am, working as a data scientist. Breaking into data science isn’t easy, but it’s possible with determination. The path I took involved self-learning, completing projects, and building a network of professionals.\nHere’s my advice: don’t let your background define you. Focus on developing the necessary skills, working on real-world projects, and leveraging your unique perspective to your advantage. It’s possible to transition into tech from almost any field.",
    "engagements": 243
  },
  {
    "text": "New hires are like fresh paint over cracked walls.\n\nIf the foundation of your workplace culture is toxic, adding new talent won’t solve the problem—it just masks it temporarily. Eventually, they’ll see the cracks and look for the exit.\n\nTo build a lasting team, start by fixing the core issues:\n\n-Encourage open feedback without fear of repercussions.\n-Emphasize growth and balance for everyone.\n-Show genuine appreciation and prioritize well-being.\n\nRetention isn’t about hiring; it’s about creating a place people want to stay. Let’s focus on building a culture that truly supports our teams.",
    "engagements": 1089
  },
  {
    "text": "I have said this to most candidates that I interview that I have not seen their CV, because I do not believe in a piece of paper and rather have a conversation with them.\n\nLast week, this approach proved its worth again. During an interview, instead of reviewing bullet points on a resume, we had a genuine conversation that revealed something no document could capture – raw talent and drive.\n\nHere's why more companies need to look beyond the paper:\n\n1. Attitude > Skills: You can train someone on the technical stuff, but you can’t teach passion or drive.\n\n2. New Eyes, New Ideas: Sometimes, those who are new to a role bring fresh perspectives that seasoned professionals might overlook.\n\n3. Potential Pays Off: When you trust your instincts and focus on someone's capacity to grow, they often exceed even your highest expectations.\n\nNext time you're hiring, try putting the CV aside. Have a real conversation. Look for the spark, the drive to learn and grow, because that's where true potential lies.\n\nHave you ever taken a chance on someone who surprised you?",
    "engagements": 5981
  },
  {
    "text": "Depression looks like me.\n\nAnxiety looks like me.\n\nMental health looks like me.\n\nMental health is never visible, especially in the workplace.\n\nYou can be the happiest person in the world on the outside, but that’s all that people see.\n\nThey don’t know what actually goes on for someone on the inside, internally.\n\nSigns that someone is struggling could be that they start becoming distant, withdrawing, avoidance, taking longer to respond.\n\nWhich is so important to have grace, compassion, and to seek understanding in the workplace when someone who is not performing at their best could have something else going on.\n\nInstead of repercussions, implement empathy and perspective.\n\nI’m thankful I had a manager who when they saw me clocking into work later, took longer to respond, or missed meetings, something was wrong because it was out of character for me.\n\nInstead of lecturing me and saying I need to be 'professional' and put my personal issues aside, they helped me take time off and gave me mental health days.\n\nMental health is never visible and is overlooked everyday.\n\nMental health looks like me, it looks like you, your coworkers, your loved ones, your friends, the person smiling through social media.",
    "engagements": 1919
  },
  {
    "text": "For people that have depression, no interest in anything, or feel like they have no purpose, how do you keep going in life?",
    "engagements": 18000
  },
  {
    "text": "Now that it is virtually certain that Donald Trump wins the election. What is the likely impact for NL and Europe?",
    "engagements": 130
  },
  {
    "text": "In my experience it's impossible to learn anything math adjacent without exercises. For ML techniques, what helps me is little 'meta' problems like I'd ask myself how a particular function would be represented/learned by a method, or some stats analysis, something that wouldn't be prohibitively hard, but still would require me to think for a bit.\n\nAs the most basic example possible, I have been asking myself e.g. if I have Y that is completely explainable by speed, and my X is time and distance, what would different methods learn, e.g. how would a simple NN fit it? And I myself learned embarrassingly a lot, many obvious-looking things this way.\n\nEverything I ever watched or read without exercises slipped my mind immediately.",
    "engagements": 200
  },
  {
    "text": "In my experience it's impossible to learn anything math adjacent without exercises. For ML techniques, what helps me is little 'meta' problems like I'd ask myself how a particular function would be represented/learned by a method, or some stats analysis, something that wouldn't be prohibitively hard, but still would require me to think for a bit.\n\nAs the most basic example possible, I have been asking myself e.g. if I have Y that is completely explainable by speed, and my X is time and distance, what would different methods learn, e.g. how would a simple NN fit it? And I myself learned embarrassingly a lot, many obvious-looking things this way.\n\nEverything I ever watched or read without exercises slipped my mind immediately.",
    "engagements": 200
  },
  {
    "text": "Young Thug tweets and deletes a message to Gunna:\n\n'Gunna stop acting like we friends on the internet, I don’t know u my guy.'",
    "engagements": 175
  },
  {
    "text": "Drake flew to Young Thug just 2 hours after he was released from jail and gave him $1,000,000",
    "engagements": 14000
  }
  
]